{
  "scenes": [
    {
      "id": "title_card",
      "title": "Why a New Language?",
      "startSec": 0.25,
      "endSec": 4.2,
      "cues": [
        {
          "id": "title",
          "label": "Title",
          "startSec": 0.25,
          "endSec": 4.2,
          "text": "Why do we need a new language?",
          "bullets": []
        }
      ]
    },
    {
      "id": "paradigm",
      "title": "A New Kind of Computer Program",
      "startSec": 4.2,
      "endSec": 70.48617726946917,
      "cues": [
        {
          "id": "paradigm_shift",
          "label": "Paradigm Shift",
          "startSec": 4.2,
          "endSec": 48.57,
          "text": "Since the dawn of computing over 80 years ago, programming has meant one thing: anticipate every scenario and write code for it. Parse this format. Catch that error. Map these fields to those fields. If you miss a case, the program breaks.\n But tool‑using agents flip the script. Instead of explicitly handling every possible scenario, you define the procedure and let the agent work inside guardrails.\n In this new kind of programming, first you start with an AI agent, a language model.\n then you give it a tool.\n You assign it a procedure to follow,\n and you put guardrails around that, to guide it toward the goal.",
          "bullets": []
        },
        {
          "id": "paradigm_shift_wrap",
          "label": "Paradigm Shift Wrap",
          "startSec": 48.68617726946916,
          "endSec": 70.48617726946917,
          "text": "Well... okay, but how do you do that, exactly? How do you write programs where the important ideas are procedures, tools, and guardrails?\n That kind of question about how to represent the things that we care about in our computer programs has been the story of programming from the start: as the problems change, we keep inventing higher-level ways to express what we mean. So let’s rewind.",
          "bullets": []
        }
      ]
    },
    {
      "id": "machine_code_era",
      "title": "In the Beginning",
      "startSec": 70.48617726946917,
      "endSec": 301.33617726946915,
      "cues": [
        {
          "id": "history",
          "label": "History",
          "startSec": 70.48617726946917,
          "endSec": 301.33617726946915,
          "text": "In the beginning, programmers wrote raw machine code. Zeros and ones. It was cumbersome, confusing, slow, and error-prone. And it was *low-level* in a very literal sense: those zeros and ones corresponded to physical states— voltage on a wire, a relay position, or a vacuum tube being on or off. Sometimes that meant wiring plugboards or toggling switches. Later it meant punching numeric opcodes. You were squinting down in the guts of the machine, and your “program” was basically a description of that machine.\n One practical mercy was hexadecimal notation. Hex wasn’t invented for computers — it’s ancient — but it became newly useful here. It didn’t change what the computer executed, but it gave humans patterns and chunks they could recognize.\n Assemblers emerged almost immediately. Instead of binary opcodes, you could write symbolic instructions. Researchers formalized those patterns into names and labels, making “machine instructions” legible to humans. The computer translated them into machine code. And once you can name things, you can reuse them: labels, macros, and early subroutines made programs repeatable instead of handcrafted.\n But the deeper shift is that assemblers introduced a two‑step workflow. Now there are two programs in the story: the assembler, and *your* program.\n You write code in a form that’s easier for humans to understand. Then you run the assembler — a program — to turn that into machine code. And *then* the computer runs the machine code.\n That’s the key step: one of the first useful things people ever did with computers was use them to make using computers easier. Even when computer time was precious, people spent some of it on tools that made programming faster, safer, and more repeatable.\n From there, the ladder of abstraction rose quickly. In the late 1950s and 1960s, early high-level languages like Fortran, Lisp, COBOL, ALGOL, and APL let humans describe problems more directly, while compilers handled the low-level details. Lisp, for example, was built for symbolic problems: lists, recursion, and treating code as data so you can transform programs like any other structure.\n One especially influential descendant of that era was C. It kept you close to the machine, but its constructs made repetition and reuse explicit: functions you could call again, and control flow you could reason about.\n C plus plus — and object-oriented programming more broadly — tried to match another problem space: large systems made of interacting “things” with state and responsibilities.\n And languages like Ruby pushed toward expressing intent directly: code that reads closer to what a human means, so the computer does more of the bookkeeping.\n But through all of this, the paradigm never changed. The programmer still specified control flow. The computer still followed instructions.\n Today, we're seeing the same pattern repeat with AI. One of the first valuable uses of AI is to turn it on itself: using AI to make programming easier, and to write better code.\n Tactus continues that tradition. It raises the level of abstraction to match what engineers care about in agentic systems: procedures, tools, guardrails, checkpoints, and evaluation. So you can express those concerns directly.\n But this time, something deeper is changing. It's not just a higher level of abstraction. It's a fundamentally different way of making decisions.",
          "bullets": []
        }
      ]
    },
    {
      "id": "control_flow",
      "title": "Control Flow Evolution",
      "startSec": 301.33617726946915,
      "endSec": 357.3361772694692,
      "cues": [
        {
          "id": "shift",
          "label": "The Shift",
          "startSec": 301.33617726946915,
          "endSec": 357.3361772694692,
          "text": "Today, decisions are no longer made entirely by imperative logic written by programmers.\n In agentic patterns like the ReAct loop, you *explicitly* hand control flow to the model: it decides what tool to call next, and when it’s done.\n That’s one of the clearest definitions of “agentic programming”: the agent is making the control-flow decisions.\n And that’s what we mean by a new kind of computer program. Instead of specifying every branch, you yield control to the AI model — and you surround that loop with guardrails.\n Even a basic guardrail matters immediately: you can’t let the loop run forever. So you might cap it at, say, twelve tool calls — and require the agent to stop or ask for help after that.\n Tactus is designed to make that style of program—and those guardrails—explicit and easy to reason about.",
          "bullets": []
        }
      ]
    },
    {
      "id": "tools_strain",
      "title": "Existing Tools Strain",
      "startSec": 357.3361772694692,
      "endSec": 390.03617726946925,
      "cues": [
        {
          "id": "python_problem",
          "label": "Python Problem",
          "startSec": 357.3361772694692,
          "endSec": 390.03617726946925,
          "text": "So why not just use Python? Or TypeScript? They're powerful, flexible languages.\n The problem isn't capability. It's fit.\n Look at this code. How do you checkpoint an agent call? How do you test it? How do you prevent it from reading slash-etsy-slash-password?\n These concerns exist, but they're bolted on. Fragmented across code, prompts, configuration, and external frameworks.\n The language wasn't designed for this.",
          "bullets": []
        }
      ]
    },
    {
      "id": "practices_collapse",
      "title": "Deterministic Practices Collapse",
      "startSec": 390.03617726946925,
      "endSec": 424.2861772694692,
      "cues": [
        {
          "id": "testing_breaks",
          "label": "Testing Breaks",
          "startSec": 390.03617726946925,
          "endSec": 424.2861772694692,
          "text": "For decades, software engineering best practices have been built around one assumption: determinism.\n Unit tests assert exact values. Code coverage measures every line. Regression tests catch unexpected changes.\n But when your system makes decisions probabilistically, all of these practices break.\n Output varies between runs. Behavior comes from models, not code. Natural variation looks like regression.\n Instead of proving correctness, you measure alignment.",
          "bullets": []
        }
      ]
    },
    {
      "id": "beyond_mlops",
      "title": "Beyond MLOps",
      "startSec": 424.2861772694692,
      "endSec": 453.4361772694692,
      "cues": [
        {
          "id": "mlops_comparison",
          "label": "MLOps Comparison",
          "startSec": 424.2861772694692,
          "endSec": 453.4361772694692,
          "text": "Machine learning practitioners have dealt with stochastic systems for years. They track experiments. Compare models. Optimize metrics.\n But MLOps is optimized for models, not behavior.\n Agentic systems don't just produce predictions. They take actions. Use tools. Generate multi-step behaviors.\n Success isn't a single number. It's whether the system behaves acceptably given the situation.",
          "bullets": []
        }
      ]
    },
    {
      "id": "specifications",
      "title": "Behavioral Specifications",
      "startSec": 453.4361772694692,
      "endSec": 486.8861772694692,
      "cues": [
        {
          "id": "specs_and_evals",
          "label": "Specs and Evals",
          "startSec": 453.4361772694692,
          "endSec": 486.8861772694692,
          "text": "When correctness becomes alignment, you need new ways to say what \"good\" looks like.\n Behavioral specifications express what a system should do without prescribing exactly how.\n A specification might say: the agent should call the search tool before answering a factual question.\n Then evaluation measures reliability. Does it do that ninety-five percent of the time? Eighty percent? Sixty?\n Specifications plus evaluations give you a foundation for alignment.",
          "bullets": []
        }
      ]
    },
    {
      "id": "props",
      "title": "PrOps",
      "startSec": 486.8861772694692,
      "endSec": 524.8861772694693,
      "cues": [
        {
          "id": "procedures",
          "label": "Procedures",
          "startSec": 486.8861772694692,
          "endSec": 524.8861772694693,
          "text": "This brings us to a new operational discipline: PrOps. Procedure Operations.\n DevOps operates deterministic programs. MLOps trains and serves models.\n But agentic systems are neither. They're procedures.\n Systems that combine imperative logic, learned components, tools, constraints, and evaluation into a single decision-making process.\n A procedure's quality can't be proven in advance or reduced to a single metric.\n It must be observed, measured, and aligned over time.",
          "bullets": []
        }
      ]
    },
    {
      "id": "new_language",
      "title": "Why a New Language",
      "startSec": 524.8861772694693,
      "endSec": 580.7361772694693,
      "cues": [
        {
          "id": "first_class_primitives",
          "label": "First Class Primitives",
          "startSec": 524.8861772694693,
          "endSec": 580.7361772694693,
          "text": "Once procedures become the primary unit of computation, the limitations of existing languages become impossible to ignore.\n Programming languages shape how humans think about problems. They determine what's easy to express and what's invisible.\n Procedural, behavior-driven systems need different primitives.\n Durability by default. Automatic checkpointing and resumption.\n Sandboxing by default. Isolated execution with controlled access.\n Tool capability control.\n Durable human‑in‑the‑loop: approvals and review loops that can pause and resume without keeping a process alive.\n Behavioral testing. Observable execution.\n These concerns can't be bolted onto languages that weren't designed for them.\n They need to be first-class.",
          "bullets": []
        }
      ]
    },
    {
      "id": "evolution",
      "title": "Evolution, Not Alien DNA",
      "startSec": 580.7361772694693,
      "endSec": 630.3361772694692,
      "cues": [
        {
          "id": "conclusion",
          "label": "Conclusion",
          "startSec": 580.7361772694693,
          "endSec": 630.3361772694692,
          "text": "From a theoretical standpoint, nothing fundamental has broken.\n These systems still run on conventional hardware. They're still Turing-complete. There's no alien machinery hiding beneath the surface.\n What has changed is how decisions are made and how humans must reason about those decisions.\n For most of computing history, programming meant specifying control flow in advance.\n Today, many of the most important systems we build no longer operate that way.\n Languages follow mental models. When the mental model changes, new languages emerge—not to replace what came before, but to make the new reality tractable for humans.\n This isn't a revolution in computation. It's evolution.",
          "bullets": []
        }
      ]
    },
    {
      "id": "cta",
      "title": "Call to Action",
      "startSec": 630.3361772694692,
      "endSec": 634.3861772694692,
      "cues": [
        {
          "id": "cta",
          "label": "CTA",
          "startSec": 630.3361772694692,
          "endSec": 634.3861772694692,
          "text": "Learn more at tactus dot anth dot u s.",
          "bullets": []
        }
      ]
    }
  ]
}
