{
  "scenes": [
    {
      "id": "paradigm",
      "title": "A New Kind of Computer Program",
      "startSec": 0.25,
      "endSec": 65.88617726946917,
      "cues": [
        {
          "id": "paradigm",
          "label": "Paradigm",
          "startSec": 0.25,
          "endSec": 45.67,
          "text": "Since the dawn of computing over 80 years ago, programming has meant one thing: anticipate every scenario and write code for it. Parse this format. Catch that error. Map these fields to those fields. If you miss a case, the program breaks.\n But tool‑using agents flip the script. Instead of explicitly handling every possible scenario, you define the procedure and let the agent work inside guardrails.\n In this new kind of programming, first you start with an AI agent, a language model.\n then you give it a tool.\n You assign it a procedure to follow,\n and you put guardrails around that, to guide it toward the goal.",
          "bullets": []
        },
        {
          "id": "paradigm_wrap",
          "label": "Paradigm Wrap",
          "startSec": 45.786177269469164,
          "endSec": 65.88617726946917,
          "text": "Well... okay, but how do you do that, exactly?  Can you write computer programs that are about giving agents tools and procedures and guardrails?\n Yes!  There is a new kind of programming language for this new kind of program.  Tactus is a programming language for tool‑using agents.",
          "bullets": []
        }
      ]
    },
    {
      "id": "hello_world",
      "title": "Hello, World",
      "startSec": 65.88617726946917,
      "endSec": 97.13617726946916,
      "cues": [
        {
          "id": "hello_world",
          "label": "Hello World",
          "startSec": 65.88617726946917,
          "endSec": 97.13617726946916,
          "text": "Tactus procedures are computer programs that include imperative instructions, like any other programmin language, but it has first-class, high-level constructs for the things that we care about now as AI engineers: procedures that revolve around agents that can make decisions, armed with powerful tools that can do real work, in a sandboxed environment to keep us all safe.\n You run Tactus procedures just like you wold run a program in any other language like Python or Node.\n Here's an exmaple of running a hello-world program from the command line.  The procedure runs and returns the response from the agent.",
          "bullets": []
        }
      ]
    },
    {
      "id": "tools",
      "title": "Tools Everywhere",
      "startSec": 97.13617726946916,
      "endSec": 117.08617726946916,
      "cues": [
        {
          "id": "tools",
          "label": "Tools",
          "startSec": 97.13617726946916,
          "endSec": 117.08617726946916,
          "text": "In a Tactus procedure, tools can come from many places. You can write tools as pure Tactus procedures, or you can use tools from the standard library.\n Shell commands—like git, ffmpeg, or your own CLIs.\n And MCP tools: local or remote MCP servers.",
          "bullets": []
        }
      ]
    },
    {
      "id": "security",
      "title": "Tools Are Sharp",
      "startSec": 117.08617726946916,
      "endSec": 146.23617726946915,
      "cues": [
        {
          "id": "security",
          "label": "Security",
          "startSec": 117.08617726946916,
          "endSec": 146.23617726946915,
          "text": "Okay, so we give powerful tools to AI agents and let them run around unsupervised.  What could possibly go wrong?\n Running tool‑using agents unattended is like giving a monkey a razor blade and hoping for the best.  And \"hope\" is not a strategy for scaling AI in production.\n Without guardrails, you can turn your laptop or your cloud account into a crime scene. That’s why Tactus runs on a secure runtime, to sandbox the agent and the tools it uses.",
          "bullets": []
        }
      ]
    },
    {
      "id": "defense_layers",
      "title": "Defense in Depth",
      "startSec": 146.23617726946915,
      "endSec": 175.83617726946918,
      "cues": [
        {
          "id": "defense_layers",
          "label": "Defense Layers",
          "startSec": 146.23617726946915,
          "endSec": 175.83617726946918,
          "text": "Tactus uses defense in depth: multiple layers of guardrails, where each layer reduces a different class of risk.\n This includes cost limits, prompt engineering, tool boundaries, code sandboxing, container isolation, and a secretless broker. Each layer enforces least privilege: agents get only what they need, when they need it.\n Let's zoom in on how sandboxing and containerization keep the agent contained.",
          "bullets": []
        }
      ]
    },
    {
      "id": "least_privilege",
      "title": "Least Privilege by Design",
      "startSec": 175.83617726946918,
      "endSec": 213.98617726946924,
      "cues": [
        {
          "id": "least_privilege",
          "label": "Least Privilege",
          "startSec": 175.83617726946918,
          "endSec": 213.98617726946924,
          "text": "Each of these guardrails enforces a principle: least privilege.\n Tactus limits what agents can do, along multiple dimensions.\n Minimal toolsets—only what the procedure needs.\n Curated context—relevant information, not everything.\n Network isolation—the runtime is networkless by default.\n A secretless broker—credentials stay outside the container.\n And temporal gating—tools become available only when the workflow stage requires them.",
          "bullets": []
        }
      ]
    },
    {
      "id": "guardrails",
      "title": "Sandboxed and Contained",
      "startSec": 213.98617726946924,
      "endSec": 270.2361772694692,
      "cues": [
        {
          "id": "guardrails",
          "label": "Guardrails",
          "startSec": 213.98617726946924,
          "endSec": 270.2361772694692,
          "text": "First, procedure code runs in a restricted Lua sandbox with limited capabilities.\n Second, that sandbox runs in a fresh container each time you run it.  Sort of like an AWS Lambda function.  The container can only see the folder you run the procedure from, and any other folder you explicitly share with it.  You can mount folders as read-only to prevent accidents.\n When the agent needs privileged work—like calling an AI model provider or a credentialed API tool—it does that throgh a broker that runs outside the sandbox.\n This way, the AI agents can't access your API keys or other sensitive data because it's all outside the sandbox and the container, both.  Your procedure code can use third-party APIs that require tokens or API keys without worrying about them being shared with AI companies or stolen through prompt injection hacks.",
          "bullets": []
        }
      ]
    },
    {
      "id": "hitl",
      "title": "Human-in-the-Loop",
      "startSec": 270.2361772694692,
      "endSec": 301.7361772694692,
      "cues": [
        {
          "id": "hitl",
          "label": "HITL",
          "startSec": 270.2361772694692,
          "endSec": 301.7361772694692,
          "text": "Even with guardrails, you still need humans at the moments that matter. If an agent is about to take an irreversible action, you want a human to approve it.\n And sometimes the right outcome isn’t yes or no — it’s: send it back for edits. A procedure can draft an artifact, ask for review, and then continue with the revised version.\n And it’s durable. The procedure can pause completely while it waits — no compute, no cost — and resume hours later exactly where it left off. That’s human‑in‑the‑loop at scale.",
          "bullets": []
        }
      ]
    },
    {
      "id": "graphs",
      "title": "No Graphs Required",
      "startSec": 301.7361772694692,
      "endSec": 318.9361772694692,
      "cues": [
        {
          "id": "graphs",
          "label": "Compare",
          "startSec": 301.7361772694692,
          "endSec": 318.9361772694692,
          "text": "In a lot of systems, this forces you into a graph workflow: nodes, edges, conditional edges, and explicit checkpointing.\n With Tactus, it’s transparent. You write normal code, and the runtime handles pausing and resuming behind the scenes.",
          "bullets": []
        }
      ]
    },
    {
      "id": "nutshell",
      "title": "Tactus in a Nutshell",
      "startSec": 318.9361772694692,
      "endSec": 339.6361772694693,
      "cues": [
        {
          "id": "nutshell",
          "label": "Nutshell",
          "startSec": 318.9361772694692,
          "endSec": 339.6361772694693,
          "text": "Tactus in a nutshell: it’s a programming language for getting things done with agents. You arm an agent with the tools it needs to follow a procedure— and you keep it sandboxed and contained while it works.\n The goal is simple: keep the monkey in a cage, instead of handing it a razor blade and hoping for the best.",
          "bullets": []
        }
      ]
    },
    {
      "id": "cta",
      "title": "Get Started",
      "startSec": 339.6361772694693,
      "endSec": 346.7361772694693,
      "cues": [
        {
          "id": "cta",
          "label": "CTA",
          "startSec": 339.6361772694693,
          "endSec": 346.7361772694693,
          "text": "Ready to try it? Visit the web site to download the IDE and run your first procedure.",
          "bullets": []
        }
      ]
    }
  ]
}
