{
  "scenes": [
    {
      "id": "paradigm",
      "title": "A New Kind of Computer Program",
      "startSec": 0.25,
      "endSec": 58.7009038937243,
      "cues": [
        {
          "id": "paradigm",
          "label": "Paradigm",
          "startSec": 0.25,
          "endSec": 43.01090909090909,
          "text": "Since the dawn of computing, programming has always meant the same thing: anticipate every scenario and write code for it. If you miss a case, the program breaks. But tool‑using agents flip the script. Instead of explicitly handling every possible scenario, you depend on AI models to make decisions and take action for you. In this new kind of programming, first you start with an agent—a language model. Then you give it a tool. And then you assign it a procedure to follow. And then you put guardrails around that to guide it toward the goal. This is a completely new way to automate work with computers. A new kind of computer program.",
          "bullets": []
        },
        {
          "id": "paradigm_wrap",
          "label": "Paradigm Wrap",
          "startSec": 43.155449348269755,
          "endSec": 58.7009038937243,
          "text": "Okay... But how do you do that, exactly? Is there some new way to write code that's about giving agents tools and procedures? Instead of a bunch of if/then statements? Yes. Tactus is a programming language for this new paradigm.",
          "bullets": []
        }
      ]
    },
    {
      "id": "hello_world",
      "title": "Hello, World",
      "startSec": 58.7009038937243,
      "endSec": 93.43272207554249,
      "cues": [
        {
          "id": "hello_world",
          "label": "Hello World",
          "startSec": 58.7009038937243,
          "endSec": 93.43272207554249,
          "text": "Tactus procedures are computer programs that include imperative instructions, like any other language, but they have first-class, high-level constructs for the building blocks that we work with in AI engineering: agents, tools, context, and prompts. You run Tactus procedures just like you would run a program in any other language like Python or Node—as command-line programs or by embedding them in applications. Here's an example of running a hello-world program. The procedure runs and returns the response from the agent. It doesn't use a framework because the capabilities are built right into the language.",
          "bullets": []
        }
      ]
    },
    {
      "id": "interface",
      "title": "The Human Interface",
      "startSec": 93.43272207554249,
      "endSec": 188.80317529665422,
      "cues": [
        {
          "id": "interface_supervised",
          "label": "Closely Supervised",
          "startSec": 93.43272207554249,
          "endSec": 130.99635843917886,
          "text": "Connecting to agents and tools is just the beginning. The real challenge is the interface layer between the agent and the operator. The common interface for agents today is chat. You watch every step, you steer, and you stop the agent if it goes sideways. That works great for some things but depends on the human operator. The user becomes a bottleneck. When you step away to eat or sleep, the whole system stops doing anything. If you're trying to process a lot of items at scale then your capacity is limited by the human operator.You can't scale this up.",
          "bullets": []
        },
        {
          "id": "interface_unsupervised",
          "label": "Unsupervised",
          "startSec": 131.3149413085401,
          "endSec": 149.93312312672194,
          "text": "You could remove the human entirely and let the agent run free. This scales beautifully—you can process thousands of items at machine speed. But running an agent this way is like giving a monkey a razor blade. And scaling that up to industrial levels is a recipe for disaster.",
          "bullets": []
        },
        {
          "id": "interface_hitl",
          "label": "Durable HITL",
          "startSec": 150.18499347847236,
          "endSec": 188.80317529665422,
          "text": "Tactus provides a new interface layer between the human and the computer. It enables agents to send requests to the human operator and wait for a response. Requests can queue up, so that the system can continue running while the human operator isn't available. When a procedure needs a human—to approve a risky action, or to provide a missing detail—it pauses. It doesn't use any compute while it's suspended, and it doesn't depend on the runtime to continue running in memory. It can resume hours or days later, exactly where it left off. This lets you move from synchronous chat to asynchronous, industrial-scale workflows.",
          "bullets": []
        }
      ]
    },
    {
      "id": "defense_layers",
      "title": "Defense in Depth",
      "startSec": 188.80317529665422,
      "endSec": 225.19408438756332,
      "cues": [
        {
          "id": "defense_layers",
          "label": "Defense Layers",
          "startSec": 188.80317529665422,
          "endSec": 225.19408438756332,
          "text": "Tactus gives you levers of control at multiple layers. Because no single layer is sufficient on its own. Cost and limits to prevent runaway loops and billing surprises. Prompt engineering to guide model behavior. Context engineering to ensure the model has the right information, not just all information. Model selection for the right capabilities and safety profiles. Tool selection. Give the agent only the capabilities it needs. Code sandboxing in isolated environments. And container isolation to constrain what the agent can touch, and to firewall side effects inside an ephemeral container.",
          "bullets": []
        }
      ]
    },
    {
      "id": "sandboxing",
      "title": "Sandboxing",
      "startSec": 225.19408438756332,
      "endSec": 270.9577207511997,
      "cues": [
        {
          "id": "sandboxing",
          "label": "Sandboxing",
          "startSec": 225.19408438756332,
          "endSec": 270.9577207511997,
          "text": "We know AI models make mistakes. Maybe your agent writes buggy tool code that deletes files. Or maybe a prompt injection tells it to send your data to a competitor. To keep the surprises firewalled off, Tactus runs your code in a restricted Lua sandbox inside a networkless container. That answers one security question: what can it touch? The other question is the one that matters most: what can it steal? Tactus keeps the runtime secretless: keys and privileged calls live outside the container, behind a broker boundary. It’s like letting a burglar into an empty building. Even if they get in, there’s nothing valuable inside to take. Your procedure can use powerful tools without ever handing secrets to the agent runtime.",
          "bullets": []
        }
      ]
    },
    {
      "id": "nutshell",
      "title": "Tactus in a Nutshell",
      "startSec": 270.9577207511997,
      "endSec": 287.40317529665424,
      "cues": [
        {
          "id": "nutshell",
          "label": "Nutshell",
          "startSec": 270.9577207511997,
          "endSec": 287.40317529665424,
          "text": "In a nutshell, Tactus is the interface layer for the new age of computing. It gives you high-level concepts to construct solutions, a durable runtime to handle human interaction, and a safety architecture to keep the monkey in the box.",
          "bullets": []
        }
      ]
    },
    {
      "id": "cta",
      "title": "Get Started",
      "startSec": 287.40317529665424,
      "endSec": 293.93499347847245,
      "cues": [
        {
          "id": "cta",
          "label": "CTA",
          "startSec": 287.40317529665424,
          "endSec": 293.93499347847245,
          "text": "Ready to try it? Visit the Tactus website to download the IDE and run your first procedure.",
          "bullets": []
        }
      ]
    }
  ],
  "posterTimeSec": 48
}
